tutorials/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    in
    {
	type		fixedValue;
	value		uniform (1 0 0);
    }

    out
    {
        type            zeroGradient; // inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0.01 0 0);
    }

    bottom
    {
	type		fixedValue;
	value		uniform (0 0 0);
    }

    top
    {
	type		empty;
    }

    frontAndBack
    {
	type		empty;
    }
}

// ************************************************************************* //
