tutorials/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default		none;
    div(phi,U)		bounded Gauss upwind; // linear; // limitedLinearV 1; // 
    div(phi,T)		bounded Gauss upwind; // linear; // limitedLinear 1; // 
    div(phi,Y)		bounded Gauss upwind; // linear; // limitedLinear 1; // 
    div(phi,alpha1)	bounded Gauss upwind; // linear; // limitedLinear 1; // vanLeer01; // 

    div((interpolate(alpha1)*phi),U) Gauss linear;

    div(phi,k)		bounded Gauss upwind; // linear; // 
    div(phi,epsilon)	bounded Gauss upwind; // linear; // 
    div(phi,R)		bounded Gauss upwind; // linear; // 
    div(phi,K)		bounded Gauss upwind; // linear; // 
    div(phi,Ekp)	bounded Gauss upwind; // linear; // 
    div(R)		bounded Gauss upwind; // linear; // 
    div(phiv,p)		Gauss linear;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default                    Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
}

// ************************************************************************* //
