tutorials/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.01;
        minIter         1;
    }

    "(U|T|Y|rhof|h|e|k|epsilon|R)"
    {
        solver          PBiCGStab; // PBiCG; // 
        preconditioner  DILU;
	tolerance	1e-06;
	relTol		0;
    }
}

subdict
{
    minTempCorr		1;
    maxTempCorr		20;
    alphaTol		1e-6;
    alphaRelax		0.7;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-5;
        U               1e-5;
        T               1e-5;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.7;
    }
    equations
    {
        U               0.3;
        T               0.5;
        "(k|epsilon|R)" 0.7;
    }
}


// ************************************************************************* //
